# Métodos I

In [5]:
import pandas as pd
import numpy as np

In [6]:
array1 = np.array([[1, 2, 3],
                   ['Rio de Janeiro','São Paulo','Minas Gerais'],
                   ['RJ', 'SP', 'MG']])

array1

array([['1', '2', '3'],
       ['Rio de Janeiro', 'São Paulo', 'Minas Gerais'],
       ['RJ', 'SP', 'MG']], dtype='<U14')

In [7]:
df3 = pd.DataFrame(data = array1.transpose(),
                   index = ['linha1', 'linha2', 'linha3'],
                   columns = ['identificacao', 'cidade', 'estado'])
            
df3

       identificacao          cidade estado
linha1             1  Rio de Janeiro     RJ
linha2             2       São Paulo     SP
linha3             3    Minas Gerais     MG

In [14]:
df3.identificacao = df3.identificacao.astype(int)

In [9]:
df3.count()

identificacao    3
cidade           3
estado           3
dtype: int64

In [10]:
#duplicando tabela para conferir
df3 = pd.concat([df3, df3])
df3

       identificacao          cidade estado
linha1             1  Rio de Janeiro     RJ
linha2             2       São Paulo     SP
linha3             3    Minas Gerais     MG
linha1             1  Rio de Janeiro     RJ
linha2             2       São Paulo     SP
linha3             3    Minas Gerais     MG

In [15]:
#groupby

df3.groupby(['cidade']).identificacao.sum()

cidade
Minas Gerais      3
Rio de Janeiro    1
São Paulo         2
Name: identificacao, dtype: int32

In [ ]:
#excluindo linhas duplicadas

df3.drop_duplicates(inplace=True)
df3

Módulos II

In [18]:
#trazendo dados cujo os termos contenham "1"

df3.isin([1])

        identificacao  cidade  estado
linha1           True   False   False
linha2          False   False   False
linha3          False   False   False

In [22]:
df3.identificacao.sum() #somando uma coluna
df3.identificacao.mean() #média
df3.identificacao.median() #mediana
df3.identificacao.min() #pegando o valor mínimo

1